#pragma once

#include <atomic>
#include <thread>


//-----------------------------------------------------------------------------
// [The problem with volatile]
//-----------------------------------------------------------------------------
namespace section1
{
// 구글에 검색해서 찾아보자.
// volatile의 여러 문제점들에 대한 해결책으로
// c++의 std::atomic이 존재한다.
}


//-----------------------------------------------------------------------------
// [Using std::atomic<T> for thread-safe accesses]
//-----------------------------------------------------------------------------
namespace section2
{

}
